fonecmid-diplom/src/DataProcessors/ВКМ_НачальноеЗаполнениеДанных/ВКМ_НачальноеЗаполнениеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_НачальноеЗаполнениеДанных</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <comment>Обслуживание клиента</comment>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <posting>Deny</posting>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОклада</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПроцентОтРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОтпускных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗаработнойПлаты/ВКМ_ВыплатаЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗаработнойПлаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_НачальноеЗаполнениеДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет демонстрационные данные для дипломной базы.
// Пользователей ИБ с профилями создайте вручную (см. инструкцию в ответе ассистента).
//
// Параметры:
//  Журнал - Массив из Строка - сообщения о ходе заполнения.
//
Процедура ЗаполнитьДемонстрационныеДанные(Журнал) Экспорт
	
	Если Журнал = Неопределено Тогда
		Журнал = Новый Массив;
	КонецЕсли;
	
	КоличествоДокументов = 5;
	КоличествоСтрокТЧ = 3;
	БазоваяДата = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -5));
	
	ДобавитьВЖурнал(Журнал, "=== Начало заполнения демонстрационных данных ===");
	
	ЗаполнитьКалендарьЗаПериодДемоДанных(БазоваяДата, КоличествоДокументов, Журнал);
	
	Организация = ПолучитьИлиСоздатьОрганизацию(Журнал);
	НоменклатураАбонплата = ПолучитьИлиСоздатьНоменклатуру("Абонентское обслуживание IT", Журнал);
	НоменклатураРаботы = ПолучитьИлиСоздатьНоменклатуру("Работы специалиста по часам", Журнал);
	ПолучитьИлиСоздатьНоменклатуру("Консультация по IT-инфраструктуре", Журнал);
	ПолучитьИлиСоздатьНоменклатуру("Настройка серверного оборудования", Журнал);
	ПолучитьИлиСоздатьНоменклатуру("Аудит информационной безопасности", Журнал);
	УстановитьКонстантыНоменклатуры(НоменклатураАбонплата, НоменклатураРаботы, Журнал);
	
	Контрагенты = ПолучитьИлиСоздатьКонтрагентов(КоличествоДокументов, Журнал);
	Договоры = ПолучитьИлиСоздатьДоговоры(Контрагенты, Организация, БазоваяДата, Журнал);
	Сотрудники = ПолучитьИлиСоздатьСотрудников(КоличествоДокументов, Журнал);
	УстановитьУсловияОплатыСотрудников(Сотрудники, БазоваяДата, Журнал);
	
	СоздатьДокументыОбслуживания(Договоры, Сотрудники, БазоваяДата, КоличествоДокументов, КоличествоСтрокТЧ, Журнал);
	СоздатьГрафикиОтпусков(Сотрудники, БазоваяДата, КоличествоДокументов, КоличествоСтрокТЧ, Журнал);
	СоздатьНачисленияЗарплаты(Сотрудники, БазоваяДата, КоличествоДокументов, КоличествоСтрокТЧ, Журнал);
	СоздатьНачисленияПремий(Сотрудники, БазоваяДата, КоличествоДокументов, КоличествоСтрокТЧ, Журнал);
	СоздатьВыплатыЗарплаты(Сотрудники, БазоваяДата, КоличествоДокументов, КоличествоСтрокТЧ, Журнал);
	СоздатьУведомленияТелеграм(КоличествоДокументов, Журнал);
	
	ДобавитьВЖурнал(Журнал, "=== Заполнение завершено ===");
	ДобавитьВЖурнал(Журнал, "Далее: создайте пользователей ИБ с профилями и выполните массовое создание актов за нужные месяцы.");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВЖурнал(Журнал, Текст)
	Журнал.Добавить(Текст);
КонецПроцедуры

// Заполняет ВКМ_Календарь за все годы, в которых создаются демо-документы (нужно для расчёта оклада по графику).
Процедура ЗаполнитьКалендарьЗаПериодДемоДанных(БазоваяДата, КоличествоДокументов, Журнал)
	
	КонецПериодаДемо = ДобавитьМесяц(БазоваяДата, КоличествоДокументов);
	ГодНачала = Год(БазоваяДата);
	ГодОкончания = Макс(Год(КонецПериодаДемо), Год(ТекущаяДатаСеанса()));
	
	Для ГодКалендаря = ГодНачала По ГодОкончания Цикл
		ВКМ_РасчетЗарплаты.ЗаполнитьКалендарь(ГодКалендаря);
	КонецЦикла;
	
	ДобавитьВЖурнал(Журнал, "Календарь: заполнен за " + Формат(ГодНачала, "ЧГ=0")
		+ "–" + Формат(ГодОкончания, "ЧГ=0") + " гг.");
	
КонецПроцедуры

Функция ПолучитьИлиСоздатьОрганизацию(Журнал)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДобавитьВЖурнал(Журнал, "Организация: используется существующая — " + Выборка.Ссылка);
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Объект = Справочники.Организации.СоздатьЭлемент();
	Объект.Наименование = "ООО ""ВКМ IT-Сервис""";
	Объект.НаименованиеПолное = "Общество с ограниченной ответственностью ""ВКМ IT-Сервис""";
	Объект.Записать();
	
	ДобавитьВЖурнал(Журнал, "Организация: создана — " + Объект.Ссылка);
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПолучитьИлиСоздатьНоменклатуру(Наименование, Журнал)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Наименование
	|	И НЕ Номенклатура.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Объект = Справочники.Номенклатура.СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Объект.Записать();
	
	ДобавитьВЖурнал(Журнал, "Номенклатура: создана — " + Наименование);
	Возврат Объект.Ссылка;
	
КонецФункции

Процедура УстановитьКонстантыНоменклатуры(НоменклатураАбонплата, НоменклатураРаботы, Журнал)
	
	Константы.ВКМ_НоменклатураАбонентскаяПлата.Установить(НоменклатураАбонплата);
	Константы.ВКМ_НоменклатураРаботыСпециалиста.Установить(НоменклатураРаботы);
	ДобавитьВЖурнал(Журнал, "Константы номенклатуры установлены.");
	
КонецПроцедуры

Функция ПолучитьИлиСоздатьКонтрагентов(Количество, Журнал)
	
	Результат = Новый Массив;
	ИменаКлиентов = Новый Массив;
	ИменаКлиентов.Добавить("ООО Альфа-Тех");
	ИменаКлиентов.Добавить("ЗАО Бета-Софт");
	ИменаКлиентов.Добавить("ИП Гамма");
	ИменаКлиентов.Добавить("ООО Дельта-Системы");
	ИменаКлиентов.Добавить("АО Эпсилон-Групп");
	
	Для Индекс = 0 По Количество - 1 Цикл
		
		Наименование = ИменаКлиентов[Индекс];
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование = &Наименование
		|	И НЕ Контрагенты.ПометкаУдаления";
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Добавить(Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		Объект = Справочники.Контрагенты.СоздатьЭлемент();
		Объект.Наименование = Наименование;
		Объект.Записать();
		Результат.Добавить(Объект.Ссылка);
		ДобавитьВЖурнал(Журнал, "Контрагент: создан — " + Наименование);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИлиСоздатьДоговоры(Контрагенты, Организация, БазоваяДата, Журнал)
	
	Результат = Новый Массив;
	НачалоДействия = НачалоГода(БазоваяДата);
	ОкончаниеДействия = КонецГода(ДобавитьМесяц(БазоваяДата, 12));
	СуммыАбонплаты = Новый Массив;
	СуммыАбонплаты.Добавить(15000);
	СуммыАбонплаты.Добавить(20000);
	СуммыАбонплаты.Добавить(10000);
	СуммыАбонплаты.Добавить(25000);
	СуммыАбонплаты.Добавить(18000);
	СтавкиЧаса = Новый Массив;
	СтавкиЧаса.Добавить(2500);
	СтавкиЧаса.Добавить(3000);
	СтавкиЧаса.Добавить(2000);
	СтавкиЧаса.Добавить(3500);
	СтавкиЧаса.Добавить(2800);
	
	Для Индекс = 0 По Контрагенты.Количество() - 1 Цикл
		
		Контрагент = Контрагенты[Индекс];
		НаименованиеДоговора = "Абонентское обслуживание " + (Индекс + 1);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Договоры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Договоры
		|ГДЕ
		|	Договоры.Владелец = &Контрагент
		|	И Договоры.ВидДоговора = &ВидДоговора
		|	И НЕ Договоры.ПометкаУдаления";
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Добавить(Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		Объект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		Объект.Владелец = Контрагент;
		Объект.Наименование = НаименованиеДоговора;
		Объект.Организация = Организация;
		Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
		Объект.ВКМ_ДатаНачалаДействия = НачалоДействия;
		Объект.ВКМ_ДатаОкончанияДействия = ОкончаниеДействия;
		Объект.ВКМ_СуммаАбонентскойПлаты = СуммыАбонплаты[Индекс];
		Объект.ВКМ_СтоимостьЧасаРаботы = СтавкиЧаса[Индекс];
		Объект.Записать();
		Результат.Добавить(Объект.Ссылка);
		ДобавитьВЖурнал(Журнал, "Договор: создан — " + Объект.Ссылка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИлиСоздатьСотрудников(Количество, Журнал)
	
	Результат = Новый Массив;
	Имена = Новый Массив;
	Имена.Добавить("Петров П.П.");
	Имена.Добавить("Сидоров С.С.");
	Имена.Добавить("Козлов К.К.");
	Имена.Добавить("Новиков Н.Н.");
	Имена.Добавить("Морозов М.М.");
	
	Для Индекс = 0 По Количество - 1 Цикл
		
		Наименование = Имена[Индекс];
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование = &Наименование
		|	И НЕ Пользователи.ПометкаУдаления
		|	И НЕ Пользователи.Недействителен";
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Добавить(Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		Объект = Справочники.Пользователи.СоздатьЭлемент();
		Объект.Наименование = Наименование;
		Объект.Записать();
		Результат.Добавить(Объект.Ссылка);
		ДобавитьВЖурнал(Журнал, "Сотрудник (справочник): создан — " + Наименование);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьУсловияОплатыСотрудников(Сотрудники, БазоваяДата, Журнал)
	
	Оклады = Новый Массив;
	Оклады.Добавить(80000);
	Оклады.Добавить(90000);
	Оклады.Добавить(75000);
	Оклады.Добавить(85000);
	Оклады.Добавить(70000);
	Проценты = Новый Массив;
	Проценты.Добавить(30);
	Проценты.Добавить(25);
	Проценты.Добавить(35);
	Проценты.Добавить(20);
	Проценты.Добавить(40);
	
	ПериодУсловий = НачалоМесяца(БазоваяДата);
	
	Для Индекс = 0 По Сотрудники.Количество() - 1 Цикл
		
		Сотрудник = Сотрудники[Индекс];
		
		Набор = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СоздатьНаборЗаписей();
		Набор.Отбор.Сотрудник.Установить(Сотрудник);
		Набор.Отбор.Период.Установить(ПериодУсловий);
		Набор.Прочитать();
		
		Если Набор.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = Набор.Добавить();
		Запись.Период = ПериодУсловий;
		Запись.Сотрудник = Сотрудник;
		Запись.Оклад = Оклады[Индекс];
		Запись.ПроцентОтРабот = Проценты[Индекс];
		Набор.Записать();
		
	КонецЦикла;
	
	ДобавитьВЖурнал(Журнал, "Условия оплаты сотрудников установлены.");
	
КонецПроцедуры

Процедура СоздатьДокументыОбслуживания(Договоры, Сотрудники, БазоваяДата, Количество, КоличествоСтрок, Журнал)
	
	Создано = 0;
	
	Для НомерДокумента = 1 По Количество Цикл
		
		ДатаДокумента = ДобавитьМесяц(БазоваяДата, НомерДокумента - 1);
		Договор = Договоры[НомерДокумента - 1];
		Клиент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Владелец");
		Специалист = Сотрудники[(НомерДокумента - 1) % Сотрудники.Количество()];
		
		Если ДокументОбслуживанияУжеСуществует(Договор, ДатаДокумента) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документы.ВКМ_ОбслуживаниеКлиента.СоздатьДокумент();
		ДокументОбъект.Дата = ДатаДокумента;
		ДокументОбъект.Клиент = Клиент;
		ДокументОбъект.Договор = Договор;
		ДокументОбъект.Специалист = Специалист;
		ДокументОбъект.ДатаПроведенияРабот = ДатаДокумента;
		ДокументОбъект.ВремяНачалаРаботПлан = Дата(1, 1, 1, 9, 0, 0);
		ДокументОбъект.ВремяОкончанияРаботПлан = Дата(1, 1, 1, 12, 0, 0);
		ДокументОбъект.ОписаниеПроблемы = "Демонстрационное обслуживание №" + НомерДокумента;
		
		Для НомерСтроки = 1 По КоличествоСтрок Цикл
			СтрокаРабот = ДокументОбъект.ВыполненныеРаботы.Добавить();
			СтрокаРабот.ОписаниеРабот = "Работа " + НомерСтроки + " по заявке " + НомерДокумента;
			СтрокаРабот.ФактическиПотраченоЧасов = 1 + НомерСтроки * 0.5;
			СтрокаРабот.ЧасыКОплатеКлиенту = 1 + НомерСтроки * 0.5;
		КонецЦикла;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Создано = Создано + 1;
		
	КонецЦикла;
	
	ДобавитьВЖурнал(Журнал, "Обслуживание клиента: создано документов — " + Создано);
	
КонецПроцедуры

Функция ДокументОбслуживанияУжеСуществует(Договор, ДатаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Обслуживание.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК Обслуживание
	|ГДЕ
	|	Обслуживание.Договор = &Договор
	|	И НАЧАЛОПЕРИОДА(Обслуживание.Дата, МЕСЯЦ) = &Месяц
	|	И НЕ Обслуживание.ПометкаУдаления";
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(ДатаДокумента));
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура СоздатьГрафикиОтпусков(Сотрудники, БазоваяДата, Количество, КоличествоСтрок, Журнал)
	
	Создано = 0;
	ГодГрафика = НачалоГода(БазоваяДата);
	
	Для НомерДокумента = 1 По Количество Цикл
		
		ГодДокумента = ДобавитьМесяц(ГодГрафика, (НомерДокумента - 1) * 12);
		
		Если ГрафикОтпусковУжеСуществует(ГодДокумента) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документы.ВКМ_ГрафикОтпусков.СоздатьДокумент();
		ДокументОбъект.Дата = ГодДокумента;
		ДокументОбъект.Год = ГодДокумента;
		
		Для НомерСтроки = 1 По КоличествоСтрок Цикл
			Сотрудник = Сотрудники[(НомерСтроки - 1) % Сотрудники.Количество()];
			СтрокаОтпуска = ДокументОбъект.ОтпускаСотрудников.Добавить();
			СтрокаОтпуска.Сотрудник = Сотрудник;
			СтрокаОтпуска.ДатаНачала = ДобавитьМесяц(ГодДокумента, НомерСтроки * 2);
			СтрокаОтпуска.ДатаОкончания = СтрокаОтпуска.ДатаНачала + 13;
			СтрокаОтпуска.КоличествоДней = 14;
		КонецЦикла;
		
		ДокументОбъект.Записать();
		Создано = Создано + 1;
		
	КонецЦикла;
	
	ДобавитьВЖурнал(Журнал, "График отпусков: создано документов — " + Создано);
	
КонецПроцедуры

Функция ГрафикОтпусковУжеСуществует(Год)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	График.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков КАК График
	|ГДЕ
	|	График.Год = &Год
	|	И НЕ График.ПометкаУдаления";
	Запрос.УстановитьПараметр("Год", Год);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура СоздатьНачисленияЗарплаты(Сотрудники, БазоваяДата, Количество, КоличествоСтрок, Журнал)
	
	Создано = 0;
	
	Для НомерДокумента = 1 По Количество Цикл
		
		МесяцНачисления = НачалоМесяца(ДобавитьМесяц(БазоваяДата, НомерДокумента - 1));
		
		Если НачислениеЗПУжеСуществует(МесяцНачисления) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документы.ВКМ_НачислениеЗаработнойПлаты.СоздатьДокумент();
		ДокументОбъект.Дата = КонецМесяца(МесяцНачисления);
		ДокументОбъект.МесяцНачисления = МесяцНачисления;
		
		Для НомерСтроки = 1 По КоличествоСтрок Цикл
			СтрокаСотрудника = ДокументОбъект.Сотрудники.Добавить();
			СтрокаСотрудника.Сотрудник = Сотрудники[(НомерСтроки - 1) % Сотрудники.Количество()];
		КонецЦикла;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Создано = Создано + 1;
		
	КонецЦикла;
	
	ДобавитьВЖурнал(Журнал, "Начисление ЗП: создано документов — " + Создано);
	
КонецПроцедуры

Функция НачислениеЗПУжеСуществует(МесяцНачисления)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Начисление.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты КАК Начисление
	|ГДЕ
	|	Начисление.МесяцНачисления = &Месяц
	|	И НЕ Начисление.ПометкаУдаления";
	Запрос.УстановитьПараметр("Месяц", МесяцНачисления);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура СоздатьНачисленияПремий(Сотрудники, БазоваяДата, Количество, КоличествоСтрок, Журнал)
	
	Создано = 0;
	СуммыПремий = Новый Массив;
	СуммыПремий.Добавить(10000);
	СуммыПремий.Добавить(15000);
	СуммыПремий.Добавить(8000);
	
	Для НомерДокумента = 1 По Количество Цикл
		
		ДатаДокумента = КонецМесяца(ДобавитьМесяц(БазоваяДата, НомерДокумента - 1));
		
		Если НачислениеПремииУжеСуществует(ДатаДокумента) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документы.ВКМ_НачислениеФиксированнойПремии.СоздатьДокумент();
		ДокументОбъект.Дата = ДатаДокумента;
		
		Для НомерСтроки = 1 По КоличествоСтрок Цикл
			СтрокаСотрудника = ДокументОбъект.СписокСотрудников.Добавить();
			СтрокаСотрудника.Сотрудник = Сотрудники[(НомерСтроки - 1) % Сотрудники.Количество()];
			СтрокаСотрудника.СуммаПремии = СуммыПремий[(НомерСтроки - 1) % СуммыПремий.Количество()];
		КонецЦикла;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Создано = Создано + 1;
		
	КонецЦикла;
	
	ДобавитьВЖурнал(Журнал, "Начисление премий: создано документов — " + Создано);
	
КонецПроцедуры

Функция НачислениеПремииУжеСуществует(ДатаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Премия.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВКМ_НачислениеФиксированнойПремии КАК Премия
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Премия.Дата, МЕСЯЦ) = &Месяц
	|	И НЕ Премия.ПометкаУдаления";
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(ДатаДокумента));
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура СоздатьВыплатыЗарплаты(Сотрудники, БазоваяДата, Количество, КоличествоСтрок, Журнал)
	
	Создано = 0;
	
	Для НомерДокумента = 1 По Количество Цикл
		
		ДатаДокумента = КонецМесяца(ДобавитьМесяц(БазоваяДата, НомерДокумента));
		
		Если ВыплатаЗПУжеСуществует(ДатаДокумента) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Документы.ВКМ_ВыплатаЗаработнойПлаты.СоздатьДокумент();
		ДокументОбъект.Дата = ДатаДокумента;
		ДокументОбъект.Заполнить(Неопределено);
		
		Если ДокументОбъект.Выплаты.Количество() < КоличествоСтрок Тогда
			ДокументОбъект.Выплаты.Очистить();
			Для НомерСтроки = 1 По КоличествоСтрок Цикл
				СтрокаВыплаты = ДокументОбъект.Выплаты.Добавить();
				СтрокаВыплаты.Сотрудник = Сотрудники[(НомерСтроки - 1) % Сотрудники.Количество()];
				СтрокаВыплаты.Сумма = 5000 + НомерСтроки * 1000;
			КонецЦикла;
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Создано = Создано + 1;
		
	КонецЦикла;
	
	ДобавитьВЖурнал(Журнал, "Выплата ЗП: создано документов — " + Создано);
	
КонецПроцедуры

Функция ВыплатаЗПУжеСуществует(ДатаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Выплата.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВКМ_ВыплатаЗаработнойПлаты КАК Выплата
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Выплата.Дата, МЕСЯЦ) = &Месяц
	|	И НЕ Выплата.ПометкаУдаления";
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(ДатаДокумента));
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура СоздатьУведомленияТелеграм(Количество, Журнал)
	
	Создано = 0;
	Тексты = Новый Массив;
	Тексты.Добавить("Запланировано обслуживание клиента Альфа-Тех");
	Тексты.Добавить("Запланировано обслуживание клиента Бета-Софт");
	Тексты.Добавить("Запланировано обслуживание клиента Гамма");
	Тексты.Добавить("Запланировано обслуживание клиента Дельта-Системы");
	Тексты.Добавить("Запланировано обслуживание клиента Эпсилон-Групп");
	
	Для Индекс = 0 По Количество - 1 Цикл
		
		Текст = Тексты[Индекс];
		Наименование = "Уведомление " + (Индекс + 1);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Уведомления.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК Уведомления
		|ГДЕ
		|	Уведомления.Наименование = &Наименование
		|	И НЕ Уведомления.ПометкаУдаления";
		Запрос.УстановитьПараметр("Наименование", Наименование);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Объект = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Объект.Наименование = Наименование;
		Объект.ТекстСообщения = Текст;
		Объект.Записать();
		Создано = Создано + 1;
		
	КонецЦикла;
	
	ДобавитьВЖурнал(Журнал, "Уведомления Telegram: создано — " + Создано);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
